tsung-xml-folder/xml/tsung_admin.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="base-t3-micro.eba-me6kbnmd.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="1024" unit="second"></users>
    </arrivalphase>
  </load>
  
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="admin workflow" type="ts_http" weight="1">
      <!-- 1. go to pos/orders page -->
      <request><http method="GET" url="/POS/orders"></http></request>
      <!-- wait for 3 seconds to look at how many current orders -->
      <!-- <thinktime value="3" random="true"/> -->
      <!-- 3. go to pos/inventory -->
      <request><http method="GET" url="/POS/inventory"></http></request>
      <!-- wait for 3 seconds to see if we have enough food for orders -->
      <!-- <thinktime value="3" random="true"/> -->
      <!-- 4. go to POS/sales -->
      <request><http method="GET" url="/POS/sales"></http></request>
      <!-- wait for 3 seconds to look at the sales -->
      <!-- <thinktime value="3" random="true"/> -->
    </session>
  </sessions>
</tsung>